#include <REGX52.H>

void Timer0_Init()
{
	TMOD=0x01;	//不可寻址,控制定时器的模式为模式一,TMON为功能寄存器
	
	//下面为TCON控制计数器,跳变方式
	
	TF0=0;			//硬件置1或置0
	TR0=1;			//软件置1或置0
	
	//控制计算器为1ms进行跳变,就要改变TH0,TL0的值
	//64535位十进制数,256为16的2次方,所以64535变成十六进制数,再变成8位
	//二进制数
	
	TH0=64535/256;//获取前8位的数值
	TL0=64535%256;//获取后8位的数值
	
	//控制中断系统,执行中断程序
	ET0=1;
	EA=1;
	PT0=0;
	
}

	
void main()
{
	Timer0_Init();
	while(1)
	{
	
	}
}

unsigned int T0Count;

//中断后要执行的程序
void Timer0_Routine() interrupt 1
{
	
	//上的函数代码只会执行一次，相当控制开关，开了就会一直执行定时器
	
	//执行一次后，TH0,TL0就会溢出变成0
	TH0=64535/256;
	TL0=64535%256;
	
	if(T0Count>=1000)//通过程序控制定时时间
	{
		T0Count = 0;
		P2_0 = ~P2_0;
	}
	
	T0Count++;
	
}


